{
  "backend/main.mo": "Motoko actor that manages a visitor log with password-protected operations: log a visitor entry, retrieve all entries, clear entries, and fetch the last 50 entries.",
  "backend/migration.mo": "Migration module that converts the old actor state (array-based entries) to the new state (Map-based entries with a nextId counter).",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (TeamMembersPage avatar refactor, AdminPanel log display fix, LoginPage visitor logging) to their affected files and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing short descriptions of each frontend source file, summarizing their roles and recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI element tokens.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes, auth guards (session/username checks), and a shared Layout component wrapping Header and Footer.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright info and a caffeine.ai attribution link with UTM tracking based on the current hostname.",
  "frontend/src/components/Header.tsx": "Sticky header with brand logo, desktop and mobile navigation links with active-route highlighting, and an admin panel icon link.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions: logging visitors, fetching/clearing the password-protected visitor log, and polling recent notifications.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines a dark futuristic glassmorphism theme with neon CSS custom properties and reusable component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanel.tsx": "Password-gated admin page that displays the visitor log and recent notifications, with options to refresh or clear the log using backend mutations.",
  "frontend/src/pages/HomePage.tsx": "Thin shim that re-exports LoginPage as the default export for the home route to avoid stale imports.",
  "frontend/src/pages/HostDetailsPage.tsx": "Profile page for the project host displaying skills, interests, and bio with scroll-reveal animations and a glassmorphism design.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with a typewriter welcome animation where users enter a username that is logged to the backend before navigating to the host profile page.",
  "frontend/src/pages/ProjectDetailsPage.tsx": "Renders a detailed documentation page about a page replacement algorithms project, organized into scrollable sections (introduction, objectives, algorithms, etc.) with intersection-observer reveal animations and an algorithm comparison table.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays categorized project resource requirements (hardware, software, knowledge, tools, etc.) as collapsible cards with a summary section, using intersection-observer reveal animations.",
  "frontend/src/pages/TeamMembersPage.tsx": "Shows a two-member team carousel with initials-based avatars, auto-advancing every 5 seconds, displaying each member's name, role, college, and description with slide animations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom neon/dark colors, Orbitron/Inter/Rajdhani fonts, neon box shadows, and keyframe animations; includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state at version 3, recording existing implemented features (initials avatars, admin panel log display, visitor name logging) and one pending fix to ensure backend visitor log fields are correctly returned and shown in the AdminPanel."
}