{
  "backend/main.mo": "Motoko actor that manages a visitor log with password-protected operations: log a visitor entry, retrieve all entries, clear all entries, and fetch the last 50 entries.",
  "feature_evidence.json": "Feature evidence report mapping two glassmorphic UI redesign features for TeamMembersPage.tsx to their test IDs, affected files, and component dependencies.",
  "frontend-file-summaries.txt": "JSON document summarizing the purpose and recent changes of each frontend source file for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI element tokens.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes, auth guards for protected pages, and a shared Layout component wrapping Header and Footer.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright info and a caffeine.ai attribution link with UTM tracking based on the current hostname.",
  "frontend/src/components/Header.tsx": "Sticky glassmorphic header with brand logo, desktop and mobile navigation links with active-route highlighting, and an admin panel icon link.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an anonymous or authenticated identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout state, and exposes identity and status to the component tree via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions: logging visitors, fetching/clearing the visitor log (password-protected), and polling recent notifications every 30 seconds.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining a dark futuristic glassmorphism theme with custom CSS variables, neon color tokens, scrollbar styles, and reusable component classes like glass-card.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Password-gated admin page that displays the visitor log and recent notifications, with options to refresh or clear the log using backend mutations.",
  "frontend/src/pages/HomePage.tsx": "Thin shim that re-exports LoginPage as the default export for the home route to avoid stale imports.",
  "frontend/src/pages/HostDetailsPage.tsx": "Profile page for the host displaying skills, interests, and a glassmorphic avatar card with scroll-reveal animations.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with a typewriter welcome animation where users enter a username that gets logged to the backend before navigating to the host page.",
  "frontend/src/pages/ProjectDetailsPage.tsx": "Detailed documentation page for a page-replacement algorithm project, rendering sectioned content blocks with scroll-reveal effects and algorithm comparison tables.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays a categorized list of project resources (hardware, software, knowledge, tools, etc.) as collapsible glass-styled cards with intersection-observer reveal animations and a summary section.",
  "frontend/src/pages/TeamMembersPage.tsx": "Renders an auto-advancing carousel showcasing two team members with their photos, roles, and descriptions, using glassmorphic styling and directional slide animations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom neon colors, dark palette, Orbitron/Rajdhani fonts, neon box-shadow utilities, and keyframe animations for a dark futuristic UI.",
  "project_state.json": "Tracks project state at version 3, recording existing features (glassmorphic profile image frames and CSS visual enhancements) and a pending action request to redesign team member images with the glassmorphic theme."
}