{
  "backend/main.mo": "Motoko actor that manages a visitor log with password-protected operations: log a visitor entry, retrieve all entries, clear all entries, and fetch the last 50 entries.",
  "feature_evidence.json": "Feature evidence report mapping two features—integrating Saarumathi.A's profile photo as a static asset and displaying it in the TeamMembersPage carousel—to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document summarizing the purpose and recent changes of each frontend source file, serving as a reference for build planning and code navigation.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes, auth guards (session and username checks), and a shared Layout component wrapping Header, Footer, and page outlets.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright info and a caffeine.ai attribution link with UTM tracking based on the current hostname.",
  "frontend/src/components/Header.tsx": "Sticky header with a branded logo, desktop and mobile navigation links with active-route highlighting, and an admin panel icon link.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions: logging visitors, fetching/clearing the password-protected visitor log, and polling for recent notifications.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining a dark futuristic glassmorphism theme with custom CSS variables, neon tokens, scrollbar styles, and reusable component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Password-gated admin page that displays the visitor log and recent notifications, with options to refresh or clear the log using backend mutations.",
  "frontend/src/pages/HomePage.tsx": "Thin shim that re-exports LoginPage as the default export for the home route to avoid stale imports.",
  "frontend/src/pages/HostDetailsPage.tsx": "Profile page for the host displaying a bio, skills, and interests with scroll-reveal animations and a glassmorphic layout.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page with a typewriter effect that collects a username, logs the visitor to the backend, and navigates to the host details page.",
  "frontend/src/pages/ProjectDetailsPage.tsx": "Detailed documentation page for a page-replacement algorithm project, rendering sectioned content blocks with scroll-reveal animations and algorithm comparison tables.",
  "frontend/src/pages/ResourcesPage.tsx": "Renders a categorized resources page for a file-monitoring project, displaying collapsible cards for hardware, software, knowledge, development, documentation, optional, and testing resources with intersection-observer reveal animations and a summary section.",
  "frontend/src/pages/TeamMembersPage.tsx": "Displays a carousel of two team members (Naveen V and Saarumathi A) with auto-advancing slides, directional animation, photo/fallback-initials rendering, and glassmorphic styling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom neon/dark colors, Orbitron/Rajdhani/Inter fonts, neon box-shadow utilities, and keyframe animations; includes typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Tracks project state at version 3, recording existing features and a pending action request to add and enhance Saarumathi.A's profile photo on the team details page, alongside architectural notes about the glassmorphic design."
}