{
  "kind": "build_request",
  "title": "Add and enhance Saarumathi.A's photo on TeamMembersPage",
  "projectName": "Team Showcase",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Use the uploaded photo of Saarumathi.A (IMG_20260226_111401.jpg) as the enhanced profile image static asset at frontend/public/assets/generated/saarumathi-profile-enhanced.jpg, consistent with how Naveen.V's enhanced photo was integrated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add this photo clearly for my team members Saarumathi.A and also enhance it"
        ]
      },
      "acceptanceCriteria": [
        "The enhanced photo file saarumathi-profile-enhanced.jpg is present in frontend/public/assets/generated/",
        "The image is visually enhanced (improved brightness, contrast, and sharpness) compared to the raw upload"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Display Saarumathi.A's enhanced profile photo in the TeamMembersPage carousel slide for her profile, replacing the fallback initials avatar. The photo should render inside a glassmorphic card matching the existing styling used for Naveen.V's profile slide.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add this photo clearly for my team members Saarumathi.A"
        ]
      },
      "acceptanceCriteria": [
        "Saarumathi.A's carousel slide shows her enhanced photo instead of initials fallback",
        "The photo is displayed clearly with proper cropping/framing (face and upper body visible)",
        "The photo container uses the same glassmorphic card styling as Naveen.V's slide",
        "No layout shift or sizing inconsistency between the two team member slides"
      ]
    }
  ],
  "constraints": [
    "Do not alter the carousel structure or animation logic in TeamMembersPage.tsx beyond updating the photo source for Saarumathi.A",
    "Match the exact same glassmorphic card styling already applied to Naveen.V's profile photo"
  ],
  "nonGoals": [
    "Adding any new team members beyond Saarumathi.A",
    "Modifying backend logic",
    "Changing the overall page layout or navigation"
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Enhance the portrait photo with improved brightness, contrast, sharpness, and skin tone clarity; crop to focus on face and upper body with a clean, professional look (IMG_20260226_111401.jpg > saarumathi-profile-enhanced.dim_400x500.jpg)"
    ]
  }
}